#!/bin/bash

MAX_HP=100
HP=100
GOLD=0
WEAPON="Рваная зачетка"
WEAPON_DMG=5
POTIONS=2

# Параметры игры
ROOMS_TO_WIN=10
ROOMS_CLEARED=0

# Типы монстров
MONSTERS=("Монстралова А.Р" "Монстренов Г.А" "Монстреккель Л.С" "Монстрберг С.И" "Монстрасов А.В" "Монстричек Р.В")
MONSTER_HP=(20 25 35 30 40 15)
MONSTER_DMG=(5 8 12 10 15 3)

WEAPONS=("Мятая зачетка" "Хорошая зачетка" "Зарядка от ноутбука" "Студбилет" "Пропуск в вуз")
WEAPON_DAMAGES=(10 15 8 20 12)

RED='\033[0;31m'
GREEN='\033[0;32m'
YELLOW='\033[1;33m'
NC='\033[0m' # No Color